# TargetId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..TargetId Property
TableView Class See Also
---
the element id of the element that is being viewed
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId TargetId { get; set; }
```

Visual Basic
---
```text
Public Property TargetId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TargetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TableView Class
Autodesk.Revit.DB Namespace